app/controllers/posts_controller.rb

  def index
    @posts = Post.all(:order => "created_at ASC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at ASC

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("created_at", "days", "description", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'Ruby on Rails**', "updated_at" = '2013-07-30 10:06:40.833458' WHERE "posts"."id" = 1